package com.kinl.tmall.controller;

import com.alibaba.fastjson.JSON;
        import com.kinl.tmall.pojo.Category;
        import com.kinl.tmall.pojo.Product;
        import com.kinl.tmall.service.CategoryService;
        import com.kinl.tmall.service.ProductService;
        import org.springframework.beans.factory.annotation.Autowired;
        import org.springframework.data.redis.core.StringRedisTemplate;
        import org.springframework.stereotype.Controller;
        import org.springframework.web.bind.annotation.RequestMapping;

        import java.util.ArrayList;
        import java.util.HashMap;
        import java.util.List;
        import java.util.Map;

@Controller
public class TestController {

    @Autowired
    private StringRedisTemplate stringRedisTemplate;

    @Autowired
    private CategoryService categoryService;

    @Autowired
    private ProductService productService;

    //安全座椅
    String[] a = {"法国畅销品牌","165度超大","睿睿熊定制款","开团3秒半价","双接口固定","全球销量爆款","ECE","全车型通用 ","划线价格为","正品保证","意大利","划线价为","全车型通用","isofix","165度可躺","英国原装进口 ","适配所有车型","分享奖50","安全气囊","乘车居家二用","多重安全保护","初生宝宝专用","可拆洗","源自荷兰 ","新款上线","新生儿适用","婴童推荐款","前200名","划线价为","赠送运费险","3C认证 ","百搭车型适配","第2件减","全球销量爆款","5点固定","划线价为","可折叠便携带","送护肩垫","全新升级 ","特价促销","舒适宽座舱","反向舒适可躺","5点固定","增高80mm","胡可代言 ","晒图赢80元","符合3C认证","高端大气","高速吸能","酷暑出行","3C认证","婴儿提篮","划线价为 ","本产品划线价","超值豪礼","ISOFIX"};
    //太阳镜
    String[] b = {"偏光","加拍镜片可配","镜片","时尚新款","百搭款式","单品包邮","实体专柜连锁 ","雷朋正品授权","炫彩太阳镜","高清偏光","百搭墨镜","轻奢有范儿","宝丽来偏光","专业定制 ","驾驶镜女","近视太阳镜","瘦脸效果","镂空水钻","航空铝镁合金","复古猫眼","送夜视夹片","跑男同款 ","好先生","近视用墨镜","全国包邮","出游防晒","核心偏光科技","男女通用！","开车镜 ","新品偏光墨镜","日夜两用","宝岛品质","超轻材质","专业网上定制","型酷来袭","正品验证码","可配近视镜 ","美女最爱","优雅小框","航天铝镁","品质保证","时尚版型设计","经典蛤蟆款型","城市时尚动感 ","偏光太阳镜","正品保证","玻璃镜片","安妮.海瑟薇","经典黑超","淘抢购23号"};
    //品牌女装
    String[] c = {"帽里撞色","口袋特殊材质","女巫高端定制","8月3日","女巫定制时装","时尚两件套装","6月8日 ","套装两件套","省时两件套","气质迷人","小脚裤设计","舒适面料 ","衬衫+阔腿裤","潮流个性设计","时尚开衫外套","时尚条纹设计","时尚个性设计","手机买更便宜 ","秋季新款","前200名送","假两件背带裤","高端定制","炒色渐变","春秋装新款 ","秋装新品","多变套裙","三件套装","【天猫正品】","高端定制 ","时尚刺绣印花","新品上架","2016新款","精确的裁剪","3-5天发货","时尚百搭","V领漏肩上衣","6个码 ","16夏新款","时尚洋气","漏肩棉t恤","真丝","高弹力","前4000名","时尚两件套 ","复古微喇套装","一字肩领","侧拉链连帽"};
    //时尚男鞋
    String[] d = {"头层牛皮","高端大气","天猫正品","牛皮鞋面","2016新品","真皮好品质","潮流百搭 ","奥康秋季新品","确认收货后","秋季新品","又要开学啦","2016 ","活动价","新品上市","韩版时尚","优雅休闲","奥康正品","秋季新品","穿上它 ","奥康英伦系列","工厂直营","飞线飞织","天猫5年老店","25日0点抢","奥康新品","【官方旗舰店","布洛克经典 ","夏季新品","鞋履新风尚","夏季新品","秋季新品 ","拍下联系客服","潮搭小白鞋","苹果男鞋","新品上市","头层牛皮","新品","文艺格调","真皮透气 ","热卖推荐","时尚百搭","四季皆宜","经典正装","热卖新款"};
    //男士西服
    String[] e = {"包邮申通","韩国进口面料","亮眼帅气","今赠马甲衬衫","比版型","高贵紫罗兰 ","绅士儒雅","魅力蓝色","绅士优雅","蓝色魅惑","两件套装","夏季清爽","款式简约 ","新品赠领带","免烫新郎结婚","职业正装","西装三件套","送衬衫领带","买就送精品 ","【放心购】","超值10件套","送衬衫领带","全国包邮申通","送精品胸针","镇店之宝","顺丰快递","宝石蓝西装 ","红标修身版型","西服三件套","〓热卖〓","购买送衬衫","【今日送衬衫","抗皱免熨 ","今日送豪礼","免烫西装","蓝紫混搭","今赠马甲衬衫","结婚宴会","西服三件套","送衬衫领带 ","上衣+裤子","羊毛三件套","修身显型","赠配饰礼盒","修身版型","买就送"};
    //男士手拿包
    String[] f = {"无理由退换货","专注品质领卷","优质羊皮","意大利牛皮","牛皮手包","细腻纯牛皮","头层牛皮","专注品质 ","原创设计","袋鼠手包钱包","进口鳄鱼皮","头层软皮","头层牛皮","专柜正品 ","小号可放","优质牛皮","双拉链设计","尊贵牛皮手包","6花头骨","礼盒包装","尺寸：宽29 ","头层牛皮","法国品牌","款式新颖","小号可放","正品防伪","顺丰包邮","顺丰包邮","美式高端潮牌 ","羊皮编织","限时特价！","原创设计","信封包","七匹狼经典款 ","正品防伪","头层小牛皮","七匹狼经典款","专柜正品","帕宾正品","新款特惠！！","顺丰包邮 ","袋鼠专柜正品","正品保证","秋冬新风尚","出门神器","柔软手感"};
    //男表
    String[] g = {"正品进口机芯","终身保修","机构质检","全国联保","简约两针","自动机械","正品","正品保证 ","50米防水","官方正品","明星代言品牌","三眼显示","超清晰大数字","必抢好货","钨钢情侣款特","正品保障 ","头层牛皮表带","全球联保","拍下任一项","顺丰包邮","酷黑表盘","名仕爵品牌","官方授权","全自动机械表 ","送真皮表带","全国联保","天猫正品","必抢爆款","意大利牛皮","商城正品","★★★★★","终身保修 ","深度防水","送调表器","官方授权店铺","【全国联保】","拒绝暴利","进口石英机芯","百年传承系列","官方旗舰店 ","防水休闲男士","6期免息","高端正品","【全国联保】","全自动机械表","拍下送：","专柜正品","胡兵明星代言 ","包邮","送18大礼","官方旗舰店","品牌直营","官方旗舰店","正品机械表"};
    //女表
    String[] h = {"陈小春代言","今日拍下","正品","热销万只","时尚之选","全自动机械表","进口机芯","送3件套豪礼 ","终身保修","吊牌价","奢华镶钻","气质女神款","简约奢华","赠送原装电池","高贵而神秘","官方正品 ","真皮表带","纯钨钢","【全国联保】","华少代言","镂空表盘","进口机芯","时尚简约","智典陶瓷女表 ","品牌直营","正品保证","送备用表带","蓝宝石玻璃","官方授权","终身保修","超清晰大数字 ","品牌直营","吊牌价","手链显手瘦","星辰手链女表","优惠券领取","简约超薄时尚","天然贝母表盘","至简至美 ","送真皮表带","官方授权","全国联保","全新上市","赠送原装电池","官方授权","品牌直供","不退色 ","品牌直营","展现自信优雅","官方旗舰店","情人节特惠","机芯五年保修","浪漫时尚","走时精准","气质女神腕表"};
    //空调
    String[] i = {"原装压缩机","原装变频压缩","快速冷暖","二级变频","30秒速冷","精准变频","二级能效","新品上市 ","二级变频","智能云控温","每日前10名","智能远程操控","三期免息","海尔集团出品","智能无氟变频 ","阿里智能","智能控制","25日","精确控温","青春时尚","强劲动力","一级能效 ","阿里智能","高效静音","wifi控制","除甲醛","智能除甲醛","节能变频","阿里智能","二级能效 ","二级变频","二级能效","强劲冷暖","大1.5匹","全直流变频","强劲冷暖","智能云","双模变频 ","智能操控","高效压缩机","内外双静音","热销5万台","双模变频","快速冷暖","智能变频","智能变频 ","咨询客服","省电静音","阿里智能","稀土压缩机","节能静音","静音除湿","静音除湿","阿里智能 ","阿里智能","高效静音","高效静音","wifi控制"};
    //冰箱
    String[] j = {"手机智能控制","风冷无霜","阿里云智能","阿里云智能","家用冰箱","高端变频","APP智能三","干湿分储 ","阿里云智能","天猫定制","阿里云系统","法式多门智能","阿里智能","储蓄卡付款","咨询客服","淘金币来袭 ","咨询客服","每天前30名","分期购","三门占地"};
    //原汁机
    String[] k = {"大功率慢榨","新款上市","整投整榨","低静音","8厘米大口径 ","95%出汁率","出汁率95%","新品上市","大口径免切","水果整个榨","方便实用","卧式螺旋 ","限时优惠","12分期","打开果蔬细胞","大口径免切","立式原汁机","【送】电烤箱","苏泊尔正品","40转每分 ","多功能原汁机","婴儿辅食","低至499","每天一杯","直降200","送20元","大口径 ","酵素原汁机","儿童零食机","天猫定制","每天前10名","送豆腐盒","螺旋挤压技术","96mm大口","第四代高端款 ","有口皆碑","飞利浦榨汁机","螺旋压榨技术","大扭力电机","倍多汁","限时聚惠","三年保修","小蛮腰 ","韩国原装进口","美国品牌","全新升级","店长推荐","惠人三代","前20名","韩国原装进口","韩国原装进口"};
    //扫地机器人
    String[] l = {"扫拖一体","新品上市","仿人跪式","非常夏日","纯铜电机","保修3年","经典爆款","无刷电机 ","人气爆款","热销爆款","预定省420","源自美国","5000pa","一键清扫","拍下减200 ","领券减50","强劲吸力","一千帕大吸力","天猫新风尚","智能规划清扫","8/22钜惠","全新升级归来","8月24日 ","预定送配件","新品倾城","前七百名","预定送厨具","规划路径","真正爆款","终生保修","官方正品 ","爆款升级","咨询限量送","淘金币开抢","阿里智能","iAdapt","仿人工跪式","预订享特权","仿生学侦测 ","超薄静音","陀螺仪导航","吸扫拖同步","真省320","扫吸擦一体","8/29","领券立减50","千帕吸力 ","预定送陶瓷刀","机器人节","千帕吸力","钟汉良推荐","咨询领券","WIFI智控","数码无刷电机","爆款升级"};
    //平衡车
    String[] m = {"机控遥控","搪瓷超强内胆","阿里智能","3D速热","热水器狂欢","3D动态加热","金圭经典","一级能效 ","三档功率可调","送双立人刀","全胆半胆加热","爆款低价购","4倍迅热增容","阿里智能","5昼夜保温 ","官方正品","5昼夜保温","3KW速热","立减200","全国服务热线","8月26日","全国服务热线","wifi智能 ","新品抢鲜购","新品上市","26号10点","最后一天","美的自营","限时48小时","准时预约","官方正品 ","唱快淋漓","嗨爆8月","内胆自清洁","8月26号","疯抢48小时","爆款预售","26号10点","双2100瓦 ","全国服务热线","嗨爆8月","高温抑菌","三档功率可调","三档功率可调","全网爆款","以旧换新","8月暑促 ","整机8年保修","准时预约","WIFI智控","狂欢疯抢","疯抢48小时","8年包修","每日前100","8月26号 ","每日前50","每日前100","限量抢熨烫机","品牌活动价"};
    //电热水器
    String[] n = {"机控遥控","搪瓷超强内胆","阿里智能","3D速热","热水器狂欢","3D动态加热","金圭经典","一级能效 ","三档功率可调","送双立人刀","全胆半胆加热","爆款低价购","4倍迅热增容","阿里智能","5昼夜保温 ","官方正品","5昼夜保温","3KW速热","立减200","全国服务热线","8月26日","全国服务热线","wifi智能 ","新品抢鲜购","新品上市","26号10点","最后一天","美的自营","限时48小时","准时预约","官方正品 ","唱快淋漓","嗨爆8月","内胆自清洁","8月26号","疯抢48小时","爆款预售","26号10点","双2100瓦 ","全国服务热线","嗨爆8月","高温抑菌","三档功率可调","三档功率可调","全网爆款","以旧换新","8月暑促 ","整机8年保修","准时预约","WIFI智控","狂欢疯抢","疯抢48小时","8年包修","每日前100","8月26号 ","每日前50","每日前100","限量抢熨烫机","品牌活动价"};
    //沙发
    String[] o = {"热卖推荐","高档户型客厅","16CM坐垫","匠心独运","大小户型沙发 ","8.23预售","热销爆款","高档进口牛皮","三位可躺","北美进口橡木","全香樟实木","厂家直销 ","可拆洗","4级抗污","多功能","全实木雕刻","3D玛雅绒","北美橡木","防水防污","都市转角户型 ","多功能扶手","彼爱专利产品","国际设计师","进口头层牛皮","经典爆款","可拆洗设计","优质棉麻面料 ","高档超柔绒布","进口橡木框架","欧洲白蜡木","北美黑胡桃","质保3年 ","8.29零点","头层牛皮","实木雕花","全拆洗","大师设计 ","20-22号","北美黑胡桃","泰国进口实木","8.22聚价","品质保证","优质绒布"};
    //马桶
    String[] p = {"高性价比","纳米自洁釉","盖板易拆","领券更优惠","全国联保","咨询大惊喜","咨询大惊喜 ","全自动感应","即热式功能","智能护理","官方正品","高效节水","立减300","官方正品 ","3秒速冲","送角阀软管","送角阀软管","12大中心仓","12大中心仓","蹲坐两用","领券减50","全国联保 ","德国品牌","加购收藏","加长型缸体","喷射虹吸","家装狂欢节","AB1287","领券再减","千城入户 ","强劲冲力","包安装","土豪直接付款","咨询在线客服","赠送原厂配件","新聚汇","吸力哥","九牧正品 ","覆盖区域内","指定1800","晒图返10元","1300城免","久坐舒适","晒图送20元","摩普智能马桶","双杆喷头 ","送空调扇","咨询大惊喜","节水小管家","高端大气","科勒授权","超旋风系列","限时升级 ","立减500","赠送角阀软管","法恩莎正品","12大中心仓"};
    //平板电视
    String[] q = {"屏大影院","周末","新品特惠","32吋电视机","智能网络 ","USB高清解","芒果TV在线","抢购价","USB解码","32英吋","10核","TCL品牌日 ","不要赠品","新品上市","4K硬屏","领100元券","智能高清","8月","酷暑","8月大促","天猫定制 ","智能操作系统","金色外观","三星屏幕","客厅爆款","八核配置","限时特惠 ","限时特惠","热销爆款","4K全高清","六核智能","14核4K","YUNOS","YUNOS","64位处理器 ","YUNOS","微信电视","4k超清","64位真4K","10核机芯","V字黑釉底座","4K超清 ","64位14核","海量影视","人气爆款","限时特惠","真4K屏","65吋巨屏","4K超清视界","限时特惠 ","55寸旗舰","4K机皇","曲面机皇","轻薄4K"};

    @RequestMapping("test")
    public String test(){

        //int i = 10 / 0;
        setHomeRedisData();
        return "hello";
    }

    public void setHomeRedisData(){
        ArrayList<String[]> title = new ArrayList<>();
        title.add(a);
        title.add(b);
        title.add(c);
        title.add(d);
        title.add(e);
        title.add(f);
        title.add(g);
        title.add(h);
        title.add(i);
        title.add(j);
        title.add(k);
        title.add(l);
        title.add(m);
        title.add(n);
        title.add(o);
        title.add(p);
        title.add(q);
        List<Category> all = categoryService.findAll();
        for (int i=0; i<all.size(); i++){
            Category category = all.get(i);
            List<Product> products = productService.findbyCid(category.getId());
            Map<String, Object> map = new HashMap<>();
            String[] strings = title.get(i);
            for (int j=0; j<strings.length; j++) {
                if (products.size() <= j){
                    break;
                }
                map.put(strings[j], products.get(j));
            }
            String s = JSON.toJSONString(map);
            stringRedisTemplate.opsForValue().set(category.getName(), s);
        }
    }



    /*
    平板电视
        "屏大影院","周末","新品特惠","32吋电视机","智能网络
        ","USB高清解","芒果TV在线","抢购价","USB解码","32英吋","10核","TCL品牌日
        ","不要赠品","新品上市","4K硬屏","领100元券","智能高清","8月","酷暑","8月大促","天猫定制
        ","智能操作系统","金色外观","三星屏幕","客厅爆款","八核配置","限时特惠
        ","限时特惠","热销爆款","4K全高清","六核智能","14核4K","YUNOS","YUNOS","64位处理器
        ","YUNOS","微信电视","4k超清","64位真4K","10核机芯","V字黑釉底座","4K超清
        ","64位14核","海量影视","人气爆款","限时特惠","真4K屏","65吋巨屏","4K超清视界","限时特惠
        ","55寸旗舰","4K机皇","曲面机皇","轻薄4K"

    马桶
        "高性价比","纳米自洁釉","盖板易拆","领券更优惠","全国联保","咨询大惊喜","咨询大惊喜
        ","全自动感应","即热式功能","智能护理","官方正品","高效节水","立减300","官方正品
        ","3秒速冲","送角阀软管","送角阀软管","12大中心仓","12大中心仓","蹲坐两用","领券减50","全国联保
        ","德国品牌","加购收藏","加长型缸体","喷射虹吸","家装狂欢节","AB1287","领券再减","千城入户
        ","强劲冲力","包安装","土豪直接付款","咨询在线客服","赠送原厂配件","新聚汇","吸力哥","九牧正品
        ","覆盖区域内","指定1800","晒图返10元","1300城免","久坐舒适","晒图送20元","摩普智能马桶","双杆喷头
        ","送空调扇","咨询大惊喜","节水小管家","高端大气","科勒授权","超旋风系列","限时升级
        ","立减500","赠送角阀软管","法恩莎正品","12大中心仓"

    沙发
        "热卖推荐","高档户型客厅","16CM坐垫","匠心独运","大小户型沙发
        ","8.23预售","热销爆款","高档进口牛皮","三位可躺","北美进口橡木","全香樟实木","厂家直销
        ","可拆洗","4级抗污","多功能","全实木雕刻","3D玛雅绒","北美橡木","防水防污","都市转角户型
        ","多功能扶手","彼爱专利产品","国际设计师","进口头层牛皮","经典爆款","可拆洗设计","优质棉麻面料
        ","高档超柔绒布","进口橡木框架","欧洲白蜡木","北美黑胡桃","质保3年
        ","8.29零点","头层牛皮","实木雕花","全拆洗","大师设计
        ","20-22号","北美黑胡桃","泰国进口实木","8.22聚价","品质保证","优质绒布"

    电热水器
        "机控遥控","搪瓷超强内胆","阿里智能","3D速热","热水器狂欢","3D动态加热","金圭经典","一级能效
        ","三档功率可调","送双立人刀","全胆半胆加热","爆款低价购","4倍迅热增容","阿里智能","5昼夜保温
        ","官方正品","5昼夜保温","3KW速热","立减200","全国服务热线","8月26日","全国服务热线","wifi智能
        ","新品抢鲜购","新品上市","26号10点","最后一天","美的自营","限时48小时","准时预约","官方正品
        ","唱快淋漓","嗨爆8月","内胆自清洁","8月26号","疯抢48小时","爆款预售","26号10点","双2100瓦
        ","全国服务热线","嗨爆8月","高温抑菌","三档功率可调","三档功率可调","全网爆款","以旧换新","8月暑促
        ","整机8年保修","准时预约","WIFI智控","狂欢疯抢","疯抢48小时","8年包修","每日前100","8月26号
        ","每日前50","每日前100","限量抢熨烫机","品牌活动价"

    平衡车
        "可折叠","电动平衡","12期免息","续航持久","一年免费保修","快速充电
        ","充气轮胎","两会品牌","速度可达25","免费试用","官方正品","稳定系统","顺丰包邮
        ","两会品牌","下单即送护具","手机控制","更持久更安全","大人孩子可用","低碳出行","钢铁侠灵感新","官方正品
        ","天猫品质","厂家直销","16新款","蓝牙传感器","10寸真空胎
        ","豪华款平衡车","超长续航","爆款","专利产品","工厂发货","中国人保","顺丰包邮
        ","16年新品","豪华版","16新款","比米更好","电动平衡车","天猫品质","国际CE认证
        ","中国人保","厂家直销","中国人保","爆品秒杀","赠送平安险","长续航"

    扫地机器人
        "扫拖一体","新品上市","仿人跪式","非常夏日","纯铜电机","保修3年","经典爆款","无刷电机
        ","人气爆款","热销爆款","预定省420","源自美国","5000pa","一键清扫","拍下减200
        ","领券减50","强劲吸力","一千帕大吸力","天猫新风尚","智能规划清扫","8/22钜惠","全新升级归来","8月24日
        ","预定送配件","新品倾城","前七百名","预定送厨具","规划路径","真正爆款","终生保修","官方正品
        ","爆款升级","咨询限量送","淘金币开抢","阿里智能","iAdapt","仿人工跪式","预订享特权","仿生学侦测
        ","超薄静音","陀螺仪导航","吸扫拖同步","真省320","扫吸擦一体","8/29","领券立减50","千帕吸力
        ","预定送陶瓷刀","机器人节","千帕吸力","钟汉良推荐","咨询领券","WIFI智控","数码无刷电机","爆款升级"

    原汁机
        "大功率慢榨","新款上市","整投整榨","低静音","8厘米大口径
        ","95%出汁率","出汁率95%","新品上市","大口径免切","水果整个榨","方便实用","卧式螺旋
        ","限时优惠","12分期","打开果蔬细胞","大口径免切","立式原汁机","【送】电烤箱","苏泊尔正品","40转每分
        ","多功能原汁机","婴儿辅食","低至499","每天一杯","直降200","送20元","大口径
        ","酵素原汁机","儿童零食机","天猫定制","每天前10名","送豆腐盒","螺旋挤压技术","96mm大口","第四代高端款
        ","有口皆碑","飞利浦榨汁机","螺旋压榨技术","大扭力电机","倍多汁","限时聚惠","三年保修","小蛮腰
        ","韩国原装进口","美国品牌","全新升级","店长推荐","惠人三代","前20名","韩国原装进口","韩国原装进口"

    冰箱
        "手机智能控制","风冷无霜","阿里云智能","阿里云智能","家用冰箱","高端变频","APP智能三","干湿分储
        ","阿里云智能","天猫定制","阿里云系统","法式多门智能","阿里智能","储蓄卡付款","咨询客服","淘金币来袭
        ","咨询客服","每天前30名","分期购","三门占地"

    空调
        "原装压缩机","原装变频压缩","快速冷暖","二级变频","30秒速冷","精准变频","二级能效","新品上市
        ","二级变频","智能云控温","每日前10名","智能远程操控","三期免息","海尔集团出品","智能无氟变频
        ","阿里智能","智能控制","25日","精确控温","青春时尚","强劲动力","一级能效
        ","阿里智能","高效静音","wifi控制","除甲醛","智能除甲醛","节能变频","阿里智能","二级能效
        ","二级变频","二级能效","强劲冷暖","大1.5匹","全直流变频","强劲冷暖","智能云","双模变频
        ","智能操控","高效压缩机","内外双静音","热销5万台","双模变频","快速冷暖","智能变频","智能变频
        ","咨询客服","省电静音","阿里智能","稀土压缩机","节能静音","静音除湿","静音除湿","阿里智能
        ","阿里智能","高效静音","高效静音","wifi控制"

    女表
        "陈小春代言","今日拍下","正品","热销万只","时尚之选","全自动机械表","进口机芯","送3件套豪礼
        ","终身保修","吊牌价","奢华镶钻","气质女神款","简约奢华","赠送原装电池","高贵而神秘","官方正品
        ","真皮表带","纯钨钢","【全国联保】","华少代言","镂空表盘","进口机芯","时尚简约","智典陶瓷女表
        ","品牌直营","正品保证","送备用表带","蓝宝石玻璃","官方授权","终身保修","超清晰大数字
        ","品牌直营","吊牌价","手链显手瘦","星辰手链女表","优惠券领取","简约超薄时尚","天然贝母表盘","至简至美
        ","送真皮表带","官方授权","全国联保","全新上市","赠送原装电池","官方授权","品牌直供","不退色
        ","品牌直营","展现自信优雅","官方旗舰店","情人节特惠","机芯五年保修","浪漫时尚","走时精准","气质女神腕表"

    男表
        "正品进口机芯","终身保修","机构质检","全国联保","简约两针","自动机械","正品","正品保证
        ","50米防水","官方正品","明星代言品牌","三眼显示","超清晰大数字","必抢好货","钨钢情侣款特","正品保障
        ","头层牛皮表带","全球联保","拍下任一项","顺丰包邮","酷黑表盘","名仕爵品牌","官方授权","全自动机械表
        ","送真皮表带","全国联保","天猫正品","必抢爆款","意大利牛皮","商城正品","★★★★★","终身保修
        ","深度防水","送调表器","官方授权店铺","【全国联保】","拒绝暴利","进口石英机芯","百年传承系列","官方旗舰店
        ","防水休闲男士","6期免息","高端正品","【全国联保】","全自动机械表","拍下送：","专柜正品","胡兵明星代言
        ","包邮","送18大礼","官方旗舰店","品牌直营","官方旗舰店","正品机械表"

    男士手拿包
        "无理由退换货","专注品质领卷","优质羊皮","意大利牛皮","牛皮手包","细腻纯牛皮","头层牛皮","专注品质
        ","原创设计","袋鼠手包钱包","进口鳄鱼皮","头层软皮","头层牛皮","专柜正品
        ","小号可放","优质牛皮","双拉链设计","尊贵牛皮手包","6花头骨","礼盒包装","尺寸：宽29
        ","头层牛皮","法国品牌","款式新颖","小号可放","正品防伪","顺丰包邮","顺丰包邮","美式高端潮牌
        ","羊皮编织","限时特价！","原创设计","信封包","七匹狼经典款
        ","正品防伪","头层小牛皮","七匹狼经典款","专柜正品","帕宾正品","新款特惠！！","顺丰包邮
        ","袋鼠专柜正品","正品保证","秋冬新风尚","出门神器","柔软手感"

    男士西服
        "包邮申通","韩国进口面料","亮眼帅气","今赠马甲衬衫","比版型","高贵紫罗兰
        ","绅士儒雅","魅力蓝色","绅士优雅","蓝色魅惑","两件套装","夏季清爽","款式简约
        ","新品赠领带","免烫新郎结婚","职业正装","西装三件套","送衬衫领带","买就送精品
        ","【放心购】","超值10件套","送衬衫领带","全国包邮申通","送精品胸针","镇店之宝","顺丰快递","宝石蓝西装
        ","红标修身版型","西服三件套","〓热卖〓","购买送衬衫","【今日送衬衫","抗皱免熨
        ","今日送豪礼","免烫西装","蓝紫混搭","今赠马甲衬衫","结婚宴会","西服三件套","送衬衫领带
        ","上衣+裤子","羊毛三件套","修身显型","赠配饰礼盒","修身版型","买就送"

    时尚男鞋
        "头层牛皮","高端大气","天猫正品","牛皮鞋面","2016新品","真皮好品质","潮流百搭
        ","奥康秋季新品","确认收货后","秋季新品","又要开学啦","2016
        ","活动价","新品上市","韩版时尚","优雅休闲","奥康正品","秋季新品","穿上它
        ","奥康英伦系列","工厂直营","飞线飞织","天猫5年老店","25日0点抢","奥康新品","【官方旗舰店","布洛克经典
        ","夏季新品","鞋履新风尚","夏季新品","秋季新品
        ","拍下联系客服","潮搭小白鞋","苹果男鞋","新品上市","头层牛皮","新品","文艺格调","真皮透气
        ","热卖推荐","时尚百搭","四季皆宜","经典正装","热卖新款"

    品牌女装
        "帽里撞色","口袋特殊材质","女巫高端定制","8月3日","女巫定制时装","时尚两件套装","6月8日
        ","套装两件套","省时两件套","气质迷人","小脚裤设计","舒适面料
        ","衬衫+阔腿裤","潮流个性设计","时尚开衫外套","时尚条纹设计","时尚个性设计","手机买更便宜
        ","秋季新款","前200名送","假两件背带裤","高端定制","炒色渐变","春秋装新款
        ","秋装新品","多变套裙","三件套装","【天猫正品】","高端定制
        ","时尚刺绣印花","新品上架","2016新款","精确的裁剪","3-5天发货","时尚百搭","V领漏肩上衣","6个码
        ","16夏新款","时尚洋气","漏肩棉t恤","真丝","高弹力","前4000名","时尚两件套
        ","复古微喇套装","一字肩领","侧拉链连帽"

    太阳镜
        "偏光","加拍镜片可配","镜片","时尚新款","百搭款式","单品包邮","实体专柜连锁
        ","雷朋正品授权","炫彩太阳镜","高清偏光","百搭墨镜","轻奢有范儿","宝丽来偏光","专业定制
        ","驾驶镜女","近视太阳镜","瘦脸效果","镂空水钻","航空铝镁合金","复古猫眼","送夜视夹片","跑男同款
        ","好先生","近视用墨镜","全国包邮","出游防晒","核心偏光科技","男女通用！","开车镜
        ","新品偏光墨镜","日夜两用","宝岛品质","超轻材质","专业网上定制","型酷来袭","正品验证码","可配近视镜
        ","美女最爱","优雅小框","航天铝镁","品质保证","时尚版型设计","经典蛤蟆款型","城市时尚动感
        ","偏光太阳镜","正品保证","玻璃镜片","安妮.海瑟薇","经典黑超","淘抢购23号"

    安全座椅
        "法国畅销品牌","165度超大","睿睿熊定制款","开团3秒半价","双接口固定","全球销量爆款","ECE","全车型通用
        ","划线价格为","正品保证","意大利","划线价为","全车型通用","isofix","165度可躺","英国原装进口
        ","适配所有车型","分享奖50","安全气囊","乘车居家二用","多重安全保护","初生宝宝专用","可拆洗","源自荷兰
        ","新款上线","新生儿适用","婴童推荐款","前200名","划线价为","赠送运费险","3C认证
        ","百搭车型适配","第2件减","全球销量爆款","5点固定","划线价为","可折叠便携带","送护肩垫","全新升级
        ","特价促销","舒适宽座舱","反向舒适可躺","5点固定","增高80mm","胡可代言
        ","晒图赢80元","符合3C认证","高端大气","高速吸能","酷暑出行","3C认证","婴儿提篮","划线价为
        ","本产品划线价","超值豪礼","ISOFIX"
    */
}
